Revit 2027 API
View3D.GetLevelsThatShowGrids Method
 Returns the list of levels ids where grids are displayed in this 3D view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetLevelsThatShowGrids()
Public Function GetLevelsThatShowGrids As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetLevelsThatShowGrids()
member GetLevelsThatShowGrids : unit -> ISet<ElementId>
Return Value
ISet<ElementId>
 The list of levels ids where grids are displayed in 3D views.
See Also
Reference
View3D Class
Autodesk.Revit.DB Namespace